## dev plan
```
data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.aws_security_group.cluster[0] (deposed object 80259265): Refreshing state... [id=sg-09ab7f8fde2175753]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/andrei-eks/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01938c8033e75a9fa]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=andrei-eks-cluster-20240819173916205200000001]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=391856996559]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::391856996559:user/kaushal2]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=391856996559]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=andrei-eks-cluster-20240819173916205200000001-20240819173917347400000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=andrei-eks-cluster-20240819173916205200000001-20240819173917263700000007]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2243368300]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=ff5de0e1-3f18-4ddb-9fcb-956f0f6e6afd]
data.aws_availability_zones.available: Read complete after 1s [id=eu-north-1]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-01271b5d86cec8b6c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ad1b71a0b3e3c920]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-0613c68fd190f75fb]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0272f3dbc19ae6fd6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c5e0cea02f6d7bbd]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0007f567d4817d999]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ca875887b1f181b8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-020408476ceb9cd8c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01aaaedc186a1a6db]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-092c00eb5388b2094]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-010d74926b498f993]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0dd4ecb1564644008]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0862320f31f265b55]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a3ad7e02ee3a566e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d3e5532904b1bd6e]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-08c6124109297544f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-068d418ec65c672ad]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cb9d7831618cf851]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ad1b71a0b3e3c9201080289494]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/andrei-eks]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-090dcecdfb0e9db94]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08763e05611b0b658]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-012c9175d56b2f05c]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::391856996559:policy/andrei-eks-cluster-ClusterEncryption2024081917394292720000000a]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role.this[0]: Refreshing state... [id=eks_nodes-eks-node-group-20240819173916568200000004]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-849935830]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-871494580]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-385223118]
module.eks.module.eks_managed_node_group["eks_nodes"].data.aws_caller_identity.current: Read complete after 0s [id=391856996559]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-820094185]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3299495923]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3153487773]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-599627976]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1193061123]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-4188259199]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1213339066]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-531219570]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-079d7fa2dabe21c5f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-091dfe1d70a4a5cbe]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ed07b6d00ad9f4c2]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=andrei-eks-cluster-20240819173916205200000001-2024081917394344980000000b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0194ad446c3fdcf4d]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=eks_nodes-eks-node-group-20240819173916568200000004-20240819173917187100000005]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=eks_nodes-eks-node-group-20240819173916568200000004-20240819173917282500000008]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=eks_nodes-eks-node-group-20240819173916568200000004-20240819173917217300000006]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=andrei-eks]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ca875887b1f181b81080289494]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-08-19T17:49:00Z]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::391856996559:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/F39E8026A965E3127D2DAB9ADAED7298]
module.eks.module.eks_managed_node_group["eks_nodes"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4926936813028450314]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-06f7fe528adae4640]
module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=andrei-eks:eks_nodes-2024081917490329440000000e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_eks_cluster.this[0] has been deleted
  - resource "aws_eks_cluster" "this" {
      - arn                           = "arn:aws:eks:eu-north-1:391856996559:cluster/andrei-eks" -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJT3REajVKYVd1R3N3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNE1Ua3hOek01TVRWYUZ3MHpOREE0TVRjeE56UTBNVFZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNobWEzZW0rOGdzV2w2dGFZdGwwczFZMDlzczJjNVdMdkV4NkxKNGpGK2tRaU9RZDNnS2I1SjlLWFcKRTBIVnRSZDcvVVNHdmg2eXR1MXNEL042M0h6NUI5NzRsYkYwZVdNVlh5QlRrcitoSjhUZkp6alVzMVk5bkVPTwpmSEhZUjdwSExPZHBPRGlCNlNvVldhbUU5RUZUK212elBiVG1XVm5uSXY1SzVKZEZ6ZVF2M2c1RTQ5cEFJcEthClh3MU1VNUJmVXdCOWp5WE96VDFIaWtEYzdrQ0RUNzFLOGNzVHBYTnRPR3FPenpIYXdmbGtZakczSERtNFNyaEoKenVKajVHSFNiditaRk1QR00wZ2ZZalVmcjdES1hycE9CUkgreHdOZEpKRXpRS3FHRUxXZEhZbWhDZmN5M0wyawpmNE5zOEhET1A4eExqZGxZSFZnZU9tYzQ1YnJaQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSQUtuUVVWOXA3bHBWalRNaUJ0VldqRzBQdENqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQjd5WUNEZ0h3Uwp3WktJVDlveFN3dDVrQ1BRdjhzVllZVEgrY1ZOdzl3UmZ2STJIaVZVT0FHZ2x2R244Vkk3c3ZBSWFQcEkwelhKCnpiUFpteUo1cS9VK0puM0VtS2x4b1F6V1JxTHlCNzVSMi9zdWdrdVhuakkrcWRYRkphZ0dGYml2cW1OZ3dTdmYKUGlHTTRwelJvT3kxcCtPVmdBRndObytzdTQrdDNmMUxtSEVjWXhGOFpCNlppZzB5S20yTDRkOTNGaVdIa2hhZgptTDhNcGJEbXY3RVdzeHVHNEJhOStSdVlwU29zMnpGYVBNdEIzL3F0TWYvU2k3UlhBWVdTa3NZbmZUKzdCcXIwCjM4TFFSaUszK0pGZFZpT29EcUJXK1dYZ05RbmMyWVdIMXJuTVJpRktrYnRrSTNQM2ZpK3VsUzRHOUo3azNBUXoKdk92ZWo2SUF4SkNyCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint                      = "https://F39E8026A965E3127D2DAB9ADAED7298.gr7.eu-north-1.eks.amazonaws.com" -> null
        id                            = "andrei-eks"
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/F39E8026A965E3127D2DAB9ADAED7298"
                    },
                ]
            },
        ] -> null
      - name                          = "andrei-eks" -> null
      - platform_version              = "eks.6" -> null
      - status                        = "ACTIVE" -> null
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
      - version                       = "1.30" -> null
        # (5 unchanged attributes hidden)

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
            # (1 unchanged attribute hidden)
        }

      - vpc_config {
          - cluster_security_group_id = "sg-039ef57e1a55f0321" -> null
            # (6 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_security_group.cluster[0] has been deleted
  - resource "aws_security_group" "cluster" {
      - arn                    = "arn:aws:ec2:eu-north-1:391856996559:security-group/sg-08c6124109297544f" -> null
      - id                     = "sg-08c6124109297544f" -> null
        name                   = "andrei-eks-cluster-20240819173916205300000002"
        tags                   = {
            "Name" = "andrei-eks-cluster"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] has been deleted
  - resource "aws_security_group" "node" {
      - arn                    = "arn:aws:ec2:eu-north-1:391856996559:security-group/sg-0a3ad7e02ee3a566e" -> null
      - id                     = "sg-0a3ad7e02ee3a566e" -> null
        name                   = "andrei-eks-node-20240819173916527000000003"
        tags                   = {
            "Name"                             = "andrei-eks-node"
            "kubernetes.io/cluster/andrei-eks" = "owned"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:eu-north-1:391856996559:internet-gateway/igw-0272f3dbc19ae6fd6" -> null
      - id       = "igw-0272f3dbc19ae6fd6" -> null
        tags     = {
            "Name"                             = "andrei-vpc"
            "kubernetes.io/cluster/andrei-eks" = "shared"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                          = "r-rtb-0ad1b71a0b3e3c9201080289494" -> null
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:eu-north-1:391856996559:vpc/vpc-01938c8033e75a9fa" -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0c5e0cea02f6d7bbd" -> null
      - default_route_table_id               = "rtb-01271b5d86cec8b6c" -> null
      - default_security_group_id            = "sg-0d3e5532904b1bd6e" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - id                                   = "vpc-01938c8033e75a9fa" -> null
      - instance_tenancy                     = "default" -> null
      - main_route_table_id                  = "rtb-01271b5d86cec8b6c" -> null
      - owner_id                             = "391856996559" -> null
        tags                                 = {
            "Name"                             = "andrei-vpc"
            "kubernetes.io/cluster/andrei-eks" = "shared"
        }
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0] has been deleted
  - resource "aws_eks_node_group" "this" {
      - arn                    = "arn:aws:eks:eu-north-1:391856996559:nodegroup/andrei-eks/eks_nodes-2024081917490329440000000e/7ec8b5e0-dc28-eb3f-45f9-74c1add3d8ba" -> null
      - id                     = "andrei-eks:eks_nodes-2024081917490329440000000e" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-eks_nodes-2024081917490329440000000e-7ec8b5e0-dc28-eb3f-45f9-74c1add3d8ba"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - status                 = "DEGRADED" -> null
        tags                   = {
            "Name" = "eks_nodes"
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # aws_security_group.all_worker_mgmt will be created
  + resource "aws_security_group" "all_worker_mgmt" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "all_worker_management"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.worker_group_mgmt_one will be created
  + resource "aws_security_group" "worker_group_mgmt_one" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "worker_group_mgmt_one"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.worker_group_mgmt_two will be created
  + resource "aws_security_group" "worker_group_mgmt_two" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "worker_group_mgmt_two"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # helm_release.localchart2 will be created
  + resource "helm_release" "localchart2" {
      + atomic                     = false
      + chart                      = "./charts/chart2"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "my-local-chart2"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "force_update"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "recreate_pods"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "andrei-eks"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::391856996559:role/andrei-eks-cluster-20240819173916205200000001"
      + status                        = (known after apply)
      + tags                          = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.30"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:eu-north-1:391856996559:key/ff5de0e1-3f18-4ddb-9fcb-956f0f6e6afd"
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::391856996559:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/F39E8026A965E3127D2DAB9ADAED7298" -> (known after apply)
      ~ id              = "arn:aws:iam::391856996559:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/F39E8026A965E3127D2DAB9ADAED7298" -> (known after apply)
        tags            = {
            "Name" = "andrei-eks-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.eu-north-1.amazonaws.com/id/F39E8026A965E3127D2DAB9ADAED7298" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "andrei-eks-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "andrei-eks-cluster"
        }
      + tags_all               = {
          + "Name" = "andrei-eks-cluster"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "andrei-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "andrei-eks-node"
          + "kubernetes.io/cluster/andrei-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "andrei-eks-node"
          + "kubernetes.io/cluster/andrei-eks" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2024-08-19T17:49:00Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJT3REajVKYVd1R3N3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNE1Ua3hOek01TVRWYUZ3MHpOREE0TVRjeE56UTBNVFZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNobWEzZW0rOGdzV2w2dGFZdGwwczFZMDlzczJjNVdMdkV4NkxKNGpGK2tRaU9RZDNnS2I1SjlLWFcKRTBIVnRSZDcvVVNHdmg2eXR1MXNEL042M0h6NUI5NzRsYkYwZVdNVlh5QlRrcitoSjhUZkp6alVzMVk5bkVPTwpmSEhZUjdwSExPZHBPRGlCNlNvVldhbUU5RUZUK212elBiVG1XVm5uSXY1SzVKZEZ6ZVF2M2c1RTQ5cEFJcEthClh3MU1VNUJmVXdCOWp5WE96VDFIaWtEYzdrQ0RUNzFLOGNzVHBYTnRPR3FPenpIYXdmbGtZakczSERtNFNyaEoKenVKajVHSFNiditaRk1QR00wZ2ZZalVmcjdES1hycE9CUkgreHdOZEpKRXpRS3FHRUxXZEhZbWhDZmN5M0wyawpmNE5zOEhET1A4eExqZGxZSFZnZU9tYzQ1YnJaQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSQUtuUVVWOXA3bHBWalRNaUJ0VldqRzBQdENqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQjd5WUNEZ0h3Uwp3WktJVDlveFN3dDVrQ1BRdjhzVllZVEgrY1ZOdzl3UmZ2STJIaVZVT0FHZ2x2R244Vkk3c3ZBSWFQcEkwelhKCnpiUFpteUo1cS9VK0puM0VtS2x4b1F6V1JxTHlCNzVSMi9zdWdrdVhuakkrcWRYRkphZ0dGYml2cW1OZ3dTdmYKUGlHTTRwelJvT3kxcCtPVmdBRndObytzdTQrdDNmMUxtSEVjWXhGOFpCNlppZzB5S20yTDRkOTNGaVdIa2hhZgptTDhNcGJEbXY3RVdzeHVHNEJhOStSdVlwU29zMnpGYVBNdEIzL3F0TWYvU2k3UlhBWVdTa3NZbmZUKzdCcXIwCjM4TFFSaUszK0pGZFZpT29EcUJXK1dYZ05RbmMyWVdIMXJuTVJpRktrYnRrSTNQM2ZpK3VsUzRHOUo3azNBUXoKdk92ZWo2SUF4SkNyCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ "cluster_endpoint"                   = "https://F39E8026A965E3127D2DAB9ADAED7298.gr7.eu-north-1.eks.amazonaws.com" -> (known after apply)
          ~ "cluster_service_cidr"               = "172.20.0.0/16" -> (known after apply)
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"                             = "andrei-vpc-default"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all               = {
          + "Name"                             = "andrei-vpc-default"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"                             = "andrei-vpc-default"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all               = {
          + "Name"                             = "andrei-vpc-default"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "andrei-vpc-default"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all               = {
          + "Name"                             = "andrei-vpc-default"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                             = "andrei-vpc-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all             = {
          + "Name"                             = "andrei-vpc-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                             = "andrei-vpc"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all = {
          + "Name"                             = "andrei-vpc"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                             = "andrei-vpc-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all                           = {
          + "Name"                             = "andrei-vpc-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                             = "andrei-vpc-private"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all         = {
          + "Name"                             = "andrei-vpc-private"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                             = "andrei-vpc-public"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all         = {
          + "Name"                             = "andrei-vpc-public"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "andrei-vpc-private-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "andrei-vpc-private-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "andrei-vpc-private-eu-north-1b"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "andrei-vpc-private-eu-north-1b"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "andrei-vpc-private-eu-north-1c"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "andrei-vpc-private-eu-north-1c"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/internal-elb"  = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "andrei-vpc-public-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "andrei-vpc-public-eu-north-1a"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "andrei-vpc-public-eu-north-1b"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "andrei-vpc-public-eu-north-1b"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                             = "andrei-vpc-public-eu-north-1c"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + tags_all                                       = {
          + "Name"                             = "andrei-vpc-public-eu-north-1c"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
          + "kubernetes.io/role/elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                             = "andrei-vpc"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
      + tags_all                             = {
          + "Name"                             = "andrei-vpc"
          + "kubernetes.io/cluster/andrei-eks" = "shared"
        }
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "andrei-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "eks_nodes-"
      + node_role_arn          = "arn:aws:iam::391856996559:role/eks_nodes-eks-node-group-20240819173916568200000004"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "eks_nodes"
        }
      + tags_all               = {
          + "Name" = "eks_nodes"
        }
      + version                = "1.30"

      + launch_template {
          + id      = "lt-06f7fe528adae4640"
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["eks_nodes"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version                      = 1 -> (known after apply)
        id                                   = "lt-06f7fe528adae4640"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "eks_nodes-2024081917490194330000000c"
        tags                                 = {}
      ~ vpc_security_group_ids               = [
          - "sg-0a3ad7e02ee3a566e",
        ] -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 44 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_endpoint          = "https://F39E8026A965E3127D2DAB9ADAED7298.gr7.eu-north-1.eks.amazonaws.com" -> (known after apply)
  + cluster_id                = (known after apply)
  ~ cluster_security_group_id = "sg-08c6124109297544f" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```